:- write('Λακεδαίμων.'), nl.

person('Ἀναξανδρίδας', 'Λακεδαίμων').
person('Πλείσταρχος' , 'Λακεδαίμων').
person('Πλειστοάναξ' , 'Λακεδαίμων').
person('Λεωνίδας'    , 'Λακεδαίμων').
person('Ζευξίδαμος'  , 'Λακεδαίμων').
person('Ἀναξίδαμος'  , 'Λακεδαίμων').
person('Ἀρχίδαμος'   , 'Λακεδαίμων').
person('Ξέρξης'      , 'Περσίς'    ).

dynasty('Ἀναξανδρίδας', 'Ἀγιάδαι'     ).
dynasty('Πλείσταρχος' , 'Ἀγιάδαι'     ).
dynasty('Πλειστοάναξ' , 'Ἀγιάδαι'     ).
dynasty('Λεωνίδας'    , 'Ἀγιάδαι'     ).
dynasty('Ζευξίδαμος'  , 'Εὐρυποντίδαι').
dynasty('Ἀναξίδαμος'  , 'Εὐρυποντίδαι').
dynasty('Ἀρχίδαμος'   , 'Εὐρυποντίδαι').

parent('Ἀναξανδρίδας' , 'Λεωνίδας'   ).
parent('Λεωνίδας'     , 'Πλείσταρχος').
parent('Πλείσταρχος'  , 'Πλειστοάναξ').
parent('Ζευξίδαμος'   , 'Ἀναξίδαμος' ).
parent('Ἀναξίδαμος'   , 'Ἀρχίδαμος'  ).

male('Ἀναξανδρίδας').
male('Πλείσταρχος' ).
male('Πλειστοάναξ' ).
male('Λεωνίδας'    ).
male('Ζευξίδαμος'  ).
male('Ἀναξίδαμος'  ).
male('Ἀρχίδαμος'   ).